2D_Plane_pisoFoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           uniform 0;
    }
    
    top
    {
        type            slip;
    }

    walls
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
